Repository: VeryLittleAnna/LinuxApplicationDevelopment2025
Catalog: 11_Documenting/po/*.po
Languages: ru

source: Usage: binsearch [OPTIONS]
ru: Использование: binsearch [ОПЦИИ]

source: Number guessing game using binary search algorithm
ru: Игра с угадыванием числа с помощью алгоритма бинарного поиска

source: Options:
ru: Опции:

source: -r, --roman Use Roman numerals instead of Arabic
ru: -r, --roman Использовать римские цифры вместо арабских

source: -h, --help Display this help message
ru: -h, --help Отобразить это сообщение справки

source: Description:
ru: Описание:

source: The program guesses a number between 1 (I) and %d (%s) that you think of. It uses binary search algorithm.
ru: Программа угадывает число от 1 (I) до %d (%s), которое вы задумали. Использует алгоритм двоичного поиска.

source: Answer with 'Yes' or 'No' to the questions asked by the program.
ru: Отвечай на вопросы программы с помощью 'Дa' или 'Нет'

source: Examples:
ru: Примеры:

source: binsearch Run with Arabic numerals (default)
ru: binsearch Запуск с арабскими цифрами (по умолчанию)

source: binsearch -r Run with Roman numerals
ru: binsearch -r Запуск с римскими цифрами

source: Try '%s --help' for more information.
ru: Попробуй '%s --help' для дополнительной информации.

source: Think of a number between I and %s
ru: Задумайте число от 1 до %s

source: Think of a number between 1 and %d
ru: Задумайте число от 1 до %d

source: Yes
ru: Да

source: No
ru: Нет

source: Is the number greater than %s?
ru: Ваше число больше чем %s?

source: Is the number greater than %d?
ru: Ваше число больше чем %d?

source: Error: standard input closed
ru: Ошибка: стандартный ввод закрыт

source: Error reading input
ru: Ошибка чтения

source: Incorrect answer. Two possible answers: Yes or No
ru: Некорректный ответ. Два возможных ответа: Да или Нет

source: Your number is %s!
ru: Ваше число - %s!

source: Your number is %d!
ru: Ваше число - %d!
